In [1]:
# sqlalchemy python library

In [4]:
### Step 1:

# Figure out what SQL Engine you are connecting to (PostgreSQL, MySQL, MS SQL Server)

### Step 2:

# Install the appropriate Python driver library. (GOOGLE SEARCH)
# PostgreSQL -- psycopg2
# MySQL -- pymysql
# MS SQL Server -- pyodbc

### Step 3:

# sqlalchemy library to connect to your SQL database with the driver.

### Step 4:

# Use the sqlalchemy driver connection with pandas read_sql method.
# Pandas can read in entire tables as a DataFrame or actual parse a SQL query through the
# connection:
    #   SELECT * FROM table;

In [9]:
# We are going to use SQLite because it comes with python.

import pandas as pd
import numpy as np

In [6]:
from sqlalchemy import create_engine

In [8]:
# Creating a temporaly database in the RAM

temp_db = create_engine('sqlite:///:memory:')

In [12]:
df = pd.DataFrame(data = np.random.randint(0,100,(4,4)), columns = ['a', 'b', 'c', 'd'])

In [21]:
df.to_sql(name = 'new_table2', con = temp_db, index = False)

In [16]:
# If we have already a table with "new_table" name, we're going to receive a "fail" message.
# This fail message will not overwrite the original database, 
# If we want to replace a table on our database, we can REPLACE the older table for the new one.
# We can also append the new table to the older one, this will add all the information of our
# new table to our already existing one. 

# REPLACE COMMAND WILL DROP THE OLDER TABLE AND THEN WRITE THE NEW ONE. WE CAN NOT RECOVER THE
# DROPPED TABLE.

In [17]:
newdf = pd.read_sql(sql = 'new_table', con = temp_db)

In [19]:
# If we dont want that "extra" index column, we need to settle an adittional argument
# when creating the table. (index = False)
newdf

   index   a   b   c   d
0      0  36  14  74  63
1      1  39  44  48  32
2      2  97  47  90  11
3      3  11  65   1  89

In [22]:
newdf2 = pd.read_sql(sql = 'new_table2', con = temp_db)

In [23]:
newdf2

    a   b   c   d
0  36  14  74  63
1  39  44  48  32
2  97  47  90  11
3  11  65   1  89

In [27]:
# Aniother way to read our tables from SQL.
# Need SQL knowledge

results = pd. read_sql_query(sql ='SELECT a,c FROM new_table', con = temp_db)

In [25]:
results

    a   c
0  36  74
1  39  48
2  97  90
3  11   1